//*******************************************************************************************************
&НаСервере
Функция Печать_ПолучитьСписокИзображений()
	
	Список = Новый СписокЗначений;
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	Файлы.Ссылка КАК Ссылка,
	|	Файлы.Наименование КАК Наименование
	|ИЗ
	|	Справочник.Файлы КАК Файлы");
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Список.Добавить(Выборка.Ссылка, Выборка.Наименование);
		
	КонецЦикла;
	
	Возврат Список;
	
КонецФункции
//*******************************************************************************************************
&НаКлиенте
Процедура Печать_ПослеВыбораЭлемента(Элемент, Параметры) Экспорт
 
    Если Элемент <> Неопределено Тогда

		Картинка = Новый Картинка(РаботаСФайламиСлужебныйВызовСервера.ДанныеФайлаИДвоичныеДанные(Элемент.Значение).ДвоичныеДанные);
		
		Рисунок = ТекущаяПечатнаяФорма.Рисунки.Добавить(ТипРисункаТабличногоДокумента.Картинка);		

		Рисунок.Узор			 = ТипУзораТабличногоДокумента.БезУзора;
		Рисунок.ГраницаСлева	 = Ложь;     
		Рисунок.ГраницаСнизу	 = Ложь;     
		Рисунок.ГраницаСверху	 = Ложь;     
		Рисунок.ГраницаСправа	 = Ложь;
		Рисунок.РазмерКартинки	 = РазмерКартинки.Пропорционально;
		
		Индекс = ТекущаяПечатнаяФорма.Рисунки.Индекс(Рисунок);

		ТекущаяПечатнаяФорма.Рисунки[Индекс].Картинка = Картинка;
	
		ТекущаяПечатнаяФорма.Рисунки[Индекс].РазмерКартинки = РазмерКартинки.Пропорционально;
		
		Если Элемент.Представление = "Печать" Тогда 
			
			 ТекущаяПечатнаяФорма.Рисунки[Индекс].Высота = 40;
			 ТекущаяПечатнаяФорма.Рисунки[Индекс].Ширина = 40;
			
		ИначеЕсли Элемент.Представление = "Подпись" Тогда 
			
			 ТекущаяПечатнаяФорма.Рисунки[Индекс].Высота = 20;
			 ТекущаяПечатнаяФорма.Рисунки[Индекс].Ширина = 45;
			
		КонецЕсли;
		
		ТекущаяПечатнаяФорма.Рисунки[Индекс].Расположить(ТекущаяПечатнаяФорма.Область("R1C1:R10C10"));
		
	КонецЕсли;
 
КонецПроцедуры
//*******************************************************************************************************
&НаКлиенте
Процедура Печать_ИзображениеПосле(Команда)
	
	Список = Печать_ПолучитьСписокИзображений();

	Список.ПоказатьВыборЭлемента(Новый ОписаниеОповещения("Печать_ПослеВыбораЭлемента", ЭтотОбъект), "Выберите изображение");	

КонецПроцедуры
//*******************************************************************************************************
